---
kind: method
id: M:Autodesk.Revit.DB.ReferenceIntersector.GetTargetElementIds
zh: 射线、射线相交
source: html/ec2affbb-5386-cdc6-b89c-e3605dbe7f64.htm
---
# Autodesk.Revit.DB.ReferenceIntersector.GetTargetElementIds Method

**中文**: 射线、射线相交

Gets the set of ElementIds to test from in intersection testing.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetTargetElementIds()
```

## Returns
The target ElementIds.